artillery/createItem.yml
config:
  target: https://myapi.com/dev/
  phases:
    - duration: 10
      arrivalCount: 3
  payload:
    path: 'create-item.csv'
    fields:
      - 'title'
      - 'price'
      - 'quantity'

scenarios:
  - flow:
      - post:
          url: '/item'
          json:
            title: '{{ title }}'
            price: '{{ price }}'
            quantity: '{{ quantity }}'